Dmivaka/STM32H7-ETH-LWIP/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "lwip.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "net.h"
#include "circ_buffer.h"
#include "helpers.h"
#include <string.h>

#include "stm32h7xx_ll_gpio.h"
#include "stm32h7xx_ll_spi.h"

#include "lwip.h"
#include "lwip/udp.h"

#include "libcanard/canard.h"
#include "uavcan/node/Heartbeat_1_0.h"
#include "uavcan/primitive/array/Real32_1_0.h"

#include "hl_command_msg.h"
#include "hl_state_msg.h"

#include "circular_heap.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

FDCAN_HandleTypeDef hfdcan1;
FDCAN_HandleTypeDef hfdcan2;
FDCAN_HandleTypeDef hfdcan3;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi3;
DMA_HandleTypeDef hdma_spi1_tx;
DMA_HandleTypeDef hdma_spi3_rx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim7;

/* USER CODE BEGIN PV */
FDCAN_HandleTypeDef * FDCAN_Handles_Map[3] = {&hfdcan1, &hfdcan2, &hfdcan3};

// the upper two kbytes of SRAM2 region
#pragma location=0x30007800
uint8_t SPI_TX_buf[1024] = {0};
#pragma location=0x30007C00
uint8_t SPI_RX_body[1024] = {0};

buffer_instance SPI_RX_buf = {0, NULL, 0, SPI_RX_body};

CanardInstance 	canard; // This is the core structure that keeps all of the states and allocated resources of the library instance

// each queue is bound to its dedicated can-bus - 3 on the main and 3 on the companion chip.
CanardTxQueue 	queue0; // Prioritized transmission queue that keeps CAN frames destined for transmission via one CAN interface
CanardTxQueue 	queue1;
CanardTxQueue 	queue2;
CanardTxQueue 	queue3;
CanardTxQueue 	queue4;
CanardTxQueue 	queue5;

CanardTxQueue * TxQueuesMap[6] = { &queue0, &queue1, &queue2, &queue3, &queue4, &queue5 };

//int8_t device_to_queue[12] = {1,1,2,2,3,3,4,4,5,5,6,6};
int8_t device_to_queue[12] = {  1,  0, -1,
                               -1, -1, -1,
                               -1, -1, -1,
                               -1, -1, -1}; // only null and first driver are enabled - the can1 and can0 buses respectevely

uint16_t device_node_id[12] = {  10, 11, 12,
                                 13, 14, 15,
                                 16, 17, 18,
                                 19, 20, 21 };

uint16_t device_tx_port[12] = {  1000, 1010, 1020,
                                 1030, 1040, 1050,
                                 1060, 1070, 1080,
                                 1090, 1100, 1200 };

uint16_t device_rx_port[12] = {  1001, 1011, 1021,
                                 1031, 1041, 1051,
                                 1061, 1071, 1081,
                                 1091, 1101, 1201 };

CanardRxSubscription Device0_Sub;
CanardRxSubscription Device1_Sub;
CanardRxSubscription Device2_Sub;
CanardRxSubscription Device3_Sub;
CanardRxSubscription Device4_Sub;
CanardRxSubscription Device5_Sub;
CanardRxSubscription Device6_Sub;
CanardRxSubscription Device7_Sub;
CanardRxSubscription Device8_Sub;
CanardRxSubscription Device9_Sub;
CanardRxSubscription Device10_Sub;
CanardRxSubscription Device11_Sub;

/*
CanardRxSubscription * CanardSubscriptionMap[12] = {  &Device0_Sub, &Device1_Sub, &Device2_Sub,
                                                      &Device3_Sub, &Device4_Sub, &Device5_Sub,
                                                      &Device6_Sub, &Device7_Sub, &Device8_Sub,
                                                      &Device9_Sub, &Device10_Sub, &Device11_Sub };
*/

CanardRxSubscription * CanardSubscriptionMap[12] = {  &Device0_Sub, &Device1_Sub, NULL,
                                                      NULL, NULL, NULL,
                                                      NULL, NULL, NULL,
                                                      NULL, NULL, NULL };

extern uint8_t LCM_rx_flag;
extern uint8_t LCM_tx_flag;
extern hl_command_msg rx_lcm_msg;
extern measurment tx_lcm_msg;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_FDCAN3_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI3_Init(void);
static void MX_TIM7_Init(void);
/* USER CODE BEGIN PFP */
uint8_t parse_canard_frame( uint32_t id, size_t size, void* payload);

static void *memAllocate(CanardInstance *const canard, const size_t amount);
static void memFree(CanardInstance *const canard, void *const pointer);

void process_canard_TX_queue( uint8_t queue_num );

void UDP_TX_send( uint16_t *UDP_TX_level );
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
extern uint64_t TIM7_ITs;
uint64_t micros()
{ 
  return (uint64_t)(__HAL_TIM_GET_COUNTER(&htim7) + 50000u * TIM7_ITs);
}

