Dmivaka/STM32H7-ETH-LWIP/Src/main.c
// returns the size of serialized message in bytes
uint8_t serialize_can_frame( uint8_t bus, uint32_t id, size_t size, uint8_t* src, uint8_t* dst)
{
  dst[0] = size + 5; // the first byte holds the full length of serialized frame

  uint32_t bus_id = encode_bus_id( bus, id );
  memcpy( &dst[1], &bus_id, 4);
  if( src != NULL )
  {
    memcpy( &dst[5], src, size);
  }
  return size + 5;
}

void *deserialize_can_frame( uint8_t *bus, uint32_t *id, size_t *size, uint8_t* dst, uint8_t* src)
{
  *size = src[0] - 5;
  
  *bus = decode_bus_num( *(uint32_t*)&src[1] );
  *id = decode_can_id( *(uint32_t*)&src[1] );
  
  // in case the destination pointer is zero, just unpacks the service info
  if( dst != NULL )
  {
    memcpy( dst, &src[5], *size);
  }
  
  return &src[5];
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if( htim->Instance == TIM1 )
  {
    //HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_6);
    //TIM1_Callback();
  }
}

// https://stackoverflow.com/a/25004214
uint8_t findIndex(FDCAN_HandleTypeDef *array, size_t size, FDCAN_HandleTypeDef* target) 
{
    uint8_t i=0;
    while((i<size) && (&array[i] != target)) i++;

    return (i<size) ? (i) : (-1);
}

void HAL_FDCAN_TxFifoEmptyCallback(FDCAN_HandleTypeDef *hfdcan)
{
  // this callback shouldnt be called fof disabled CAN buses, so no need to check for NULL pointer
  
  // find bus number from the handle name 
  uint8_t bus_num = findIndex(*FDCAN_Handles_Map, 3, hfdcan);
  
  while( HAL_FDCAN_GetTxFifoFreeLevel(hfdcan) != 0  )
  {
    char * vb_frame = get_queue_head( can_tx_queues[bus_num] );
    if( vb_frame != NULL )
    {
      uint8_t bus;
      uint32_t id;
      size_t frame_len;

      uint8_t *tx_data_pointer = deserialize_can_frame( &bus, &id, &frame_len, NULL, vb_frame); // only extracts service info
      
      push_can_frame( hfdcan, id, frame_len, tx_data_pointer);
      
      uint32_t primask_bit = __get_PRIMASK();       // backup PRIMASK bit
      __disable_irq();                              // Disable all interrupts by setting PRIMASK bit on Cortex
      
        circular_heap_free( can_tx_heaps[bus_num], dequeue( can_tx_queues[bus_num] ));
        
        __set_PRIMASK(primask_bit);                   // Restore PRIMASK bit
    }
    else
    {
      break ;
    }
  }
  
  return ;
}

// push CAN frame into CAN FIFO
uint8_t push_can_frame( FDCAN_HandleTypeDef *handle, uint32_t id, uint8_t length, uint8_t *payload)
{
  if (HAL_FDCAN_GetTxFifoFreeLevel(handle) != 0)
  {
    FDCAN_TxHeaderTypeDef TxHeader;
    // Add message to Tx FIFO 
    TxHeader.Identifier = id;
    TxHeader.IdType = FDCAN_EXTENDED_ID;
    TxHeader.TxFrameType = FDCAN_DATA_FRAME;
    TxHeader.DataLength = LengthCoder( length );
    TxHeader.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    TxHeader.BitRateSwitch = FDCAN_BRS_ON;
    TxHeader.FDFormat = FDCAN_FD_CAN;
    TxHeader.TxEventFifoControl = FDCAN_STORE_TX_EVENTS;
    TxHeader.MessageMarker = 0x00;
    if (HAL_FDCAN_AddMessageToTxFifoQ(handle, &TxHeader, payload) != HAL_OK)
    {
      Error_Handler();
    }
    HAL_Delay(2);
  }
  else
  {
    return 1;
  }
  
  return 0;
}

void process_canard_TX_queue( uint8_t queue_num )
{
  // Look at top of the TX queue of individual CAN frames
  for (const CanardTxQueueItem* ti = NULL; (ti = canardTxPeek( TxQueuesMap[queue_num] )) != NULL;)
  {
    if ((0U == ti->tx_deadline_usec) || (ti->tx_deadline_usec > micros()))  // Check the deadline.
    {
      uint8_t vb_frame[69];
      uint8_t vb_frame_len = ti->frame.payload_size + 5;
      vb_frame[0] = vb_frame_len;

      uint8_t bus_num = queue_num;
      
      uint32_t id = ti->frame.extended_can_id;
      uint32_t bus_id = encode_bus_id( bus_num, id );
      
      memcpy( &vb_frame[1], &bus_id, 4);
      memcpy( &vb_frame[5], (uint8_t *)ti->frame.payload, ti->frame.payload_size);
      
      distribute_vb_frame( vb_frame );
    }
    // After the frame is transmitted or if it has timed out while waiting, pop it from the queue and deallocate:
    canard.memory_free(&canard, canardTxPop( TxQueuesMap[queue_num], ti));
  }
}

volatile uint16_t zhazha = 0;

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
  if( hspi->Instance == SPI1 )
  {
    circular_heap_free( &spi_tx_heap, dequeue( &spi_tx_queue ));
    send_frame_SPI();
    zhazha++;
  }
}

// push VB CAN frame into CAN FIFO
uint8_t send_frame_SPI(void)
{
  if( !LL_SPI_IsActiveMasterTransfer(SPI1) )
  {
    char *payload = get_queue_head( &spi_tx_queue );
    if( payload != NULL )
    {
      // bind payload to SPI DMA transfer
      uint8_t data_len = payload[0];
      
      if( data_len != 13 ){     Error_Handler();        }
      
      LL_GPIO_SetOutputPin(GPIOD, LL_GPIO_PIN_6);
      HAL_SPI_Transmit_DMA(&hspi1, payload, data_len);      
    }
    else
    {
      // buffer's empty!
      //while(1);
    }
  }
  
  return 0;
}

void UDP_TX_send( uint16_t *UDP_TX_level )
{
  pbuf_realloc( UDP_TX_buf, *UDP_TX_level);

  udp_send(upcb, UDP_TX_buf);

  pbuf_free(UDP_TX_buf);
  UDP_TX_buf = pbuf_alloc(PBUF_TRANSPORT, UDP_TX_size, PBUF_RAM);
  *UDP_TX_level = 0;
}

// allocate dynamic memory of desired size in bytes
static void *memAllocate(CanardInstance *const canard, const size_t amount)
{
  (void)canard;
  return malloc(amount);
}

// free allocated memory
static void memFree(CanardInstance *const canard, void *const pointer)
{
  (void)canard;
  free(pointer);
}
/* USER CODE END 4 */

/* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x0;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

